#+TITLE: Emacs Config
#+PROPERTY: header-args :tangle "~/.emacs.d/init.el"
My personal Emacs config. Main part of the config was written with help of David Wilson [[https://www.youtube.com/watch?v=74zOY-vgkyw&list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ&index=2][Emacs From Scratch]] series. Some of the functions and keybinds were taken from [[https://gitlab.com/mmilek/emacs-config][mmilek]].
* Speed up Emacs start up (2/2)
These commands help speed up Emacs
#+BEGIN_SRC elisp
  )
  (setq gc-cons-threshold 800000)
#+END_SRC

#+RESULTS:
: 800000

